Tekla Open API Reference for Tekla Structures 2025
SpiralBeamDataException Class
 The SpiralBeamDataException class represents an error that occurred during the spiral beam creation or modification.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.SpiralBeamDataException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class SpiralBeamDataException : Exception
<SerializableAttribute>
Public Class SpiralBeamDataException
	Inherits Exception
The SpiralBeamDataException type exposes the following members.
Constructors
Name | Description
SpiralBeamDataException
 Initializes a new instance of the SpiralBeamDataException class with spiral beam error message based on status.
Top
Fields
Name | Description
ErrorStatus
 Contains error status during spiral beam creation/modification.
Top
See Also
Reference
Tekla.Structures.Model Namespace